RhinoInside.Revit API Documentation
GeometryDecoder.ToBoundingBox Method (Outline)
 Converts the specified Autodesk.Revit.DB.Outline to an equivalent Rhino.Geometry.BoundingBox.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Rhino.Geometry.BoundingBox ToBoundingBox(
	this Autodesk.Revit.DB.Outline outline
)
@staticmethod
def ToBoundingBox(
	outline: Autodesk.Revit.DB.Outline
) -> Rhino.Geometry.BoundingBox
Parameters
outline
Type: Autodesk.Revit.DB.Outline
Revit outline to convert.
Return Value
Type: Rhino.Geometry.BoundingBox
Rhino boundingBox that is equivalent to the provided Revit outline.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Outline. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToBoundingBox(Outline) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
BoundingBox rhinoBBox = revitOutline.ToBoundingBox();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_bbox = revit_outline.ToBoundingBox() # type: RG.BoundingBox
 Using ToBoundingBox(Outline) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
BoundingBox rhinoBBox = GeometryEncoder.ToBoundingBox(revitOutline)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_bbox = GD.ToBoundingBox(revit_outline) # type: RG.BoundingBox
See Also
Reference
GeometryDecoder Class
ToBoundingBox Overload
RhinoInside.Revit.Convert.Geometry Namespace